[
    {
        "consulta" : "Defina un conjunto.",
        "categoria" : "a",
        "respuesta" : "Un conjunto es una colección de objetos bien definidos. Los objetos de un conjunto se llaman elementos del conjunto.       Por ejemplo, el conjunto de los números naturales es un conjunto que contiene los números 1, 2, 3, ... El conjunto de las letras del alfabeto español es un conjunto que contiene las letras a, b, c, ... El conjunto de las personas que viven en México es un conjunto que contiene a todas las personas que residen en México.                Los conjuntos se pueden representar de diferentes maneras. Una forma común de representar un conjunto es mediante una lista de sus elementos. Por ejemplo, el conjunto de los números naturales se puede representar como {1, 2, 3, ...}.                Otra forma de representar un conjunto es mediante una descripción de sus elementos. Por ejemplo, el conjunto de las letras del alfabeto español se puede representar como el conjunto de todos los símbolos que están en el rango ASCII del 32 al 126.                Los conjuntos son una herramienta fundamental en matemáticas. Se utilizan en muchas áreas de la matemática, incluyendo la teoría de números, el álgebra, la geometría, el análisis y la probabilidad.",
        "solucion" : "Un conjunto es una coleccion de objetos o elementos. Un elemento puede pertener o no a un conjunto. Un conjunto puede tener uno o mas elementos",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "¿Cuál es la notación de conjuntos?",
        "categoria" : "a",
        "respuesta" : "La notación de conjuntos es una forma de representar conjuntos mediante símbolos matemáticos. Los conjuntos se representan por letras mayúsculas, y los elementos de un conjunto se representan por letras minúsculas.        Hay dos formas principales de representar conjuntos mediante la notación de conjuntos:                * **Notación por extensión:** En esta notación, se enumeran todos los elementos del conjunto entre llaves.        * **Notación por comprensión:** En esta notación, se especifica una condición que deben cumplir los elementos del conjunto.",
        "solucion" : "Un conjunto se representa con una letra mayuscula, sus elementos con letras minusculas o numeros (segun sea el caso). Entonces se dice que un conjunto A es igual a todos sus elementos {x|x es par}",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "Si X es un conjunto finito, ¿qué es |X|?",
        "categoria" : "a",
        "respuesta" : "Si X es un conjunto finito, |X| representa el número de elementos de X. En otras palabras, |X| es la cardinalidad de X. Por ejemplo, si X es el conjunto de los números naturales del 1 al 10, entonces |X| = 10. Si X es el conjunto de las letras del alfabeto español, entonces |X| = 27. Si X es el conjunto vacío, entonces |X| = 0. En general, si X es un conjunto finito con n elementos, entonces |X| = n.",
        "solucion" : "Se refiere a la cardinalidad de un conjunto, en simples palabras, se refiere a la cantidad de objetos o elementos que posee un conjunto discreto y finito",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "¿Cómo se denota x es un elemento del conjunto X?",
        "categoria" : "a",
        "respuesta" : "Se denota con el símbolo `∈`. La expresión `x ∈ X` se lee como 'x está en X' o 'x pertenece a X'.",        
        "solucion" : "En lenguaje de teoria de conjuntos se dice que x ∈ X, es decir x es un elemento que pertenece al conjunto X",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "¿Cómo se denota x no es un elemento del conjunto X?",
        "categoria" : "a",
        "respuesta" : "Se denota con el símbolo ∉. La expresión x ∉ X se lee como 'x no está en X' o 'x no pertenece a X'. Por ejemplo, si X es el conjunto de los números naturales, entonces 3 ∉ X, ya que 3 no es un número natural. En resumen, la notación x ∉ X se utiliza para indicar que x no es un elemento del conjunto X.",        
        "solucion" : "En lenguaje de teoria de conjuntos se dice que x ∉ X, es decir x es un elemento que no pertenece al conjunto X",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "¿Cómo se denota el conjunto vacío?",
        "categoria" : "a",
        "respuesta" : "El conjunto vacío se denota con llaves vacías, es decir, `{}`. Por ejemplo, el conjunto vacío de números naturales se denota como `{}`. En resumen, el conjunto vacío se denota con llaves vacías.",
        "solucion" : "Existen dos maneras de denotar al conjunto vacio, una de ellas es {} y la segunda es ∅",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "Defina X = Y, donde X y Y son conjuntos.",
        "categoria" : "a",
        "respuesta" : "X = Y significa que X y Y tienen los mismos elementos. En otras palabras, para todo elemento x, si x ∈ X, entonces x ∈ Y. Y, para todo elemento y, si y ∈ Y, entonces y ∈ X.",
        "solucion" : "Para todo elemento x ∈ X implica que x ∈ Y, ademas para todo y ∈ Y  implica que y ∈ X. Dicho en otras palabras si X es subconjunto de Y y Y es subconjunto de X entonces X = Y",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "Defina X ⊆ Y, donde X y Y son conjuntos.",
        "categoria" : "a",
        "respuesta" : "X ⊆ Y significa que X está contenido en Y. En otras palabras, cada elemento de X es también un elemento de Y. En resumen, X ⊆ Y significa que X es un subconjunto de Y.",
        "solucion" : "X es subconjunto de Y significa que para todo elemento x ∈ X implica que x ∈ Y. Por lo anterior si hay al menos un elemento x ∈ X tal que x ∉  Y entonces X no es subconjunto de Y",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "Defina X es un subconjunto propio de Y.",
        "categoria" : "a",
        "respuesta" : "X es un subconjunto propio de Y si X está contenido en Y, pero X no es igual a Y. En otras palabras, X ⊆ Y, pero X ≠ Y. En resumen, X es un subconjunto propio de Y si X contiene todos los elementos de Y, pero también contiene elementos que no son elementos de Y. Por ejemplo, el conjunto de los números pares es un subconjunto propio del conjunto de los números naturales. Todos los números pares son números naturales, pero hay números naturales que no son pares, como 1, 3, 5, etc.",
        "solucion" : "X es subconjunto de Y y Y no es subconjunto de Y. Es decir X diferente de Y",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "¿Cuál es el conjunto potencia de X? ¿Cómo se denota?",
        "categoria" : "a",
        "respuesta" : "El conjunto potencia de X es el conjunto de todos los subconjuntos de X. Se denota con P(X), o también con 2^X. En resumen, el conjunto potencia de X es el conjunto de todos los conjuntos que se pueden formar con los elementos de X. Por ejemplo, el conjunto potencia del conjunto {1,2,3} es el conjunto {{}, {1}, {2}, {3}, {1,2}, {2,3}, {1,3}, {1,2,3}}.",
        "solucion" : "El conjunto potencia de X se denota como 2^X. Se trata del conjunto que tiene como elementos a todos los subconjuntos de X. Otra manera de denotarlo es por P(X). Donde tambien vacio es subconjunto de cualquier conjunto arbitrario X (demostrable) asi como X es subconjunto de si mismo (X = X)",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "",
        "categoria" : "",
        "respuesta" : "",
        "solucion" : "",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "",
        "categoria" : "",
        "respuesta" : "",
        "solucion" : "",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "",
        "categoria" : "",
        "respuesta" : "",
        "solucion" : "",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "",
        "categoria" : "",
        "respuesta" : "",
        "solucion" : "",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "",
        "categoria" : "",
        "respuesta" : "",
        "solucion" : "",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "",
        "categoria" : "",
        "respuesta" : "",
        "solucion" : "",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "",
        "categoria" : "",
        "respuesta" : "",
        "solucion" : "",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    },
    {
        "consulta" : "",
        "categoria" : "",
        "respuesta" : "",
        "solucion" : "",
        "Calificacion" : 1,
        "Referencia" : "Johnsonbaugh, R. (2005). Matemáticas discretas. Pearson Educación."
    }

]